STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/Core/Src/app_entry.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_entry.c
  * @author  MCD Application Team
  * @brief   Entry point of the application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_conf.h"
#include "main.h"
#include "app_entry.h"
#include "cmsis_os2.h"
#include "stm32_rtos.h"
#include "task.h"
#if (CFG_LPM_LEVEL != 0)
#include "stm32_lpm.h"
#endif /* (CFG_LPM_LEVEL != 0) */
#include "stm32_timer.h"
#include "stm32_mm.h"
#if (CFG_LOG_SUPPORTED != 0) || (OT_CLI_USE == 1)
#include "stm32_adv_trace.h"
#include "serial_cmd_interpreter.h"
#endif /* (CFG_LOG_SUPPORTED != 0) || (OT_CLI_USE == 1)*/
#include "app_ble.h"
#include "app_thread.h"
#include "ll_sys_if.h"
#include "linklayer_plat.h"
#include "app_sys.h"
#include "otp.h"
#include "scm.h"
#include "bpka.h"
#include "ll_sys.h"
#include "advanced_memory_manager.h"
#include "flash_driver.h"
#include "flash_manager.h"
#include "simple_nvm_arbiter.h"
#include "app_debug.h"
#include "log_module.h"
#include "timer_if.h"
extern void xPortSysTickHandler (void);
extern void vPortSetupTimerInterrupt(void);
/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wba65i_discovery.h"
#include "stm32wba65i_discovery_bus.h"
#if (CFG_LCD_SUPPORTED == 1)
#include "stm32wba65i_discovery_lcd.h"
#include "stm32_lcd.h"
#endif /* CFG_LCD_SUPPORTED */
#include "stm32_lpm.h"
#if(CFG_RT_DEBUG_DTB == 1)
#include "RTDebug_dtb.h"
#endif /* CFG_RT_DEBUG_DTB */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private constants ---------------------------------------------------------*/
/* USER CODE BEGIN PC */

/* USER CODE END PC */

/* Private variables ---------------------------------------------------------*/
#if ( CFG_LPM_LEVEL != 0)
static bool system_startup_done = FALSE;
/* Holds maximum number of FreeRTOS tick periods that can be suppressed */
static uint32_t maximumPossibleSuppressedTicks = 0;
#endif /* ( CFG_LPM_LEVEL != 0) */

#if (CFG_LOG_SUPPORTED != 0)
/* Log configuration */
static Log_Module_t Log_Module_Config = { .verbose_level = APPLI_CONFIG_LOG_LEVEL, .region_mask = LOG_REGION_ALL_REGIONS };
#endif /* (CFG_LOG_SUPPORTED != 0) */

/* AMM configuration */
static uint32_t AMM_Pool[CFG_AMM_POOL_SIZE];
static AMM_VirtualMemoryConfig_t vmConfig[CFG_AMM_VIRTUAL_MEMORY_NUMBER] =
{
  /* Virtual Memory #1 */
  {
    .Id = CFG_AMM_VIRTUAL_STACK_BLE,
    .BufferSize = CFG_AMM_VIRTUAL_STACK_BLE_BUFFER_SIZE
  },
  /* Virtual Memory #2 */
  {
    .Id = CFG_AMM_VIRTUAL_APP_BLE,
    .BufferSize = CFG_AMM_VIRTUAL_APP_BLE_BUFFER_SIZE
  },
};

static AMM_InitParameters_t ammInitConfig =
{
  .p_PoolAddr = AMM_Pool,
  .PoolSize = CFG_AMM_POOL_SIZE,
  .VirtualMemoryNumber = CFG_AMM_VIRTUAL_MEMORY_NUMBER,
  .p_VirtualMemoryConfigList = vmConfig
};

static UTIL_TIMER_Object_t TimerOSwakeup_Id;
/* USER CODE BEGIN PV */
#if (CFG_JOYSTICK_SUPPORTED == 1)
static int32_t Joystick_Prev_State;
static UTIL_TIMER_Object_t JOYSTICK_TimerObj;
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */

/* FreeRtos Random Process stacks attributes */
const osThreadAttr_t stRandomProcessTaskAttributes = 
{
  .name = "Hw Random Task",
  .priority = CFG_TASK_PRIO_HW_RNG,
  .stack_size = TASK_HW_RNG_STACK_SIZE
};

/* FreeRtos Amm Background Task stacks attributes */
const osThreadAttr_t stAmmBckgTaskAttributes = 
{
  .name = "AMM Background Task",
  .priority = CFG_TASK_PRIO_AMM_BCKG,
  .stack_size = TASK_AMM_BCKG_STACK_SIZE
};

/* FreeRtos BPKA Background Task stacks attributes */
const osThreadAttr_t stBPKATaskAttributes = 
{
  .name = "BPKA Task",
  .priority = CFG_TASK_PRIO_BPKA,
  .stack_size = TASK_BPKA_STACK_SIZE
};

/* FreeRtos Flash Manager Background Task stacks attributes */
const osThreadAttr_t stFlashManagerBackgroundTaskAttributes = 
{
  .name = "Flash Manager Background Task",
  .priority = CFG_TASK_PRIO_FLASH_MANAGER_BCKGND,
  .stack_size = TASK_FLASH_MANAGER_BCKGND_STACK_SIZE,
};

osSemaphoreId_t       BpkaSemaphore;
osThreadId_t          BpkaTaskId;

osSemaphoreId_t       AppliInitEndSemaphore, HwRngSemaphore;
osThreadId_t          AppliInitTaskId, RandomProcessTaskId;

osSemaphoreId_t       AmmBckgSemaphore, FlashMangerReqSemaphore;
osThreadId_t          AmmBckgTaskId, FmBackgroundTaskId;

osSemaphoreId_t       JoystickSemaphore;
osThreadId_t          JoystickTaskId;

static UTIL_TIMER_Object_t  TimerOStick_Id;
static UTIL_TIMER_Object_t  TimerOSwakeup_Id;


#if (CFG_JOYSTICK_SUPPORTED == 1)
const osThreadAttr_t stJoySTickTaskAttributes = 
{
  .name = "Joystick Task",
  .priority = TASK_PRIO_JOYSTICK,
  .stack_size = TASK_JOYSTICK_STACK_SIZE,
};
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */
#if (CFG_JOYSTICK_SUPPORTED == 1)
uint8_t JOY_StandbyExitFlag = 0;
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
/* USER CODE END GV */

/* Private functions prototypes-----------------------------------------------*/
static void Config_HSE(void);
static void RNG_Init( void );
static void System_Init( void );
static void SystemPower_Config( void );
static void TimerOSwakeupCB(void *arg);
#if ( CFG_LPM_LEVEL != 0)
static void preOSsleepProcessing(uint32_t expectedIdleTime);
static void postOSsleepProcessing(uint32_t expectedIdleTime);
static uint32_t getCurrentTime(void);
#endif /* CFG_LPM_LEVEL */

/**
 * @brief Wrapper for init function of the MM for the AMM
 *
 * @param p_PoolAddr: Address of the pool to use - Not use -
 * @param PoolSize: Size of the pool - Not use -
 *
 * @return None
 */
static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize);

/**
 * @brief Wrapper for allocate function of the MM for the AMM
 *
 * @param BufferSize
 *
 * @return Allocated buffer
 */
static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize);

/**
 * @brief Wrapper for free function of the MM for the AMM
 *
 * @param p_BufferAddr
 *
 * @return None
 */
static void AMM_WrapperFree (uint32_t * const p_BufferAddr);

static void TimerOStickCB(void *arg);

static void BPKA_Task(void *argument);
static void AMM_Background_Task(void *argument);
static void FM_Background_Task(void *argument);
static void HW_RNG_Process_Task(void *argument);

/* USER CODE BEGIN PFP */
#if (CFG_LED_SUPPORTED == 1)
static void Led_Init(void);
#endif /* (CFG_LED_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)
static void Joystick_Init( uint8_t wkup_mode );
static void Joystick_TimerCallback(void *arg);
static void Joystick_ActionHandle(void);

static void Joystick_Task(void *argument);
#endif /* CFG_JOYSTICK_SUPPORTED */
#if (CFG_LCD_SUPPORTED == 1)
static void LCD_Init(void);
#endif /* CFG_LCD_SUPPORTED */
/* USER CODE END PFP */

