STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/Core/Src/app_entry.c
/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief   System Initialisation.
 */
void MX_APPE_Config(void)
{
  /* Configure HSE Tuning */
  Config_HSE();
}

/**
 * @brief   Background Task for AMM.
 */
void AMM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(AmmBckgSemaphore, osWaitForever);
    AMM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for Flash Manager.
 */
void FM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(FlashMangerReqSemaphore, osWaitForever);
    FM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for BPKA.
 */
void BPKA_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(BpkaSemaphore, osWaitForever);
    BPKA_BG_Process();
    osThreadYield();
  }
}

#if (CFG_JOYSTICK_SUPPORTED == 1)
/**
 * @brief   Background Task for JOYSTICK.
 */
static void Joystick_Task(void *argument)
{
  UNUSED( argument );
  UTIL_TIMER_Start(&JOYSTICK_TimerObj);
  while(1)
  {
    osSemaphoreAcquire(JoystickSemaphore, osWaitForever);
    Joystick_ActionHandle();
  }
}
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */


/**
 * @brief   System Initialisation.
 */
uint32_t MX_APPE_Init(void *p_param)
{
  APP_DEBUG_SIGNAL_SET(APP_APPE_INIT);

  UNUSED(p_param);

  /* System initialization */
  System_Init();

  /* Configure the system Power Mode */
  SystemPower_Config();

  /* Initialize the Advance Memory Manager */
  AMM_Init (&ammInitConfig);

  /* Create thread for AMM background and semaphore to control it*/
  AmmBckgSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( AmmBckgSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : AMM BACKGROUND SEMAPHORE CREATION FAILED" );
    while(1);
  }
  
  AmmBckgTaskId = osThreadNew( AMM_Background_Task, NULL, &stAmmBckgTaskAttributes );
  if ( AmmBckgTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS :  AMM BACKGROUND TASK CREATION FAILED" );
    while(1);
  }
  
  /* Initialize the Simple NVM Arbiter */
  SNVMA_Init ((uint32_t *)CFG_SNVMA_START_ADDRESS);

  /* Register Semaphore to trigger FM_Background_Task */
  FlashMangerReqSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( FlashMangerReqSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : FLASH MANAGER BACKGROUND SEMAPHORE CREATION FAILED" );
    Error_Handler();
  }

  /* Create flash manager Task over FreeRTOS */
  FmBackgroundTaskId = osThreadNew(FM_Background_Task, NULL, &stFlashManagerBackgroundTaskAttributes);
  if ( FmBackgroundTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : FLASH MANAGER BACKGROUND THREAD CREATION FAILED" );
    Error_Handler();
  }

  /* USER CODE BEGIN APPE_Init_1 */
#if (CFG_LED_SUPPORTED == 1)
  Led_Init();
#endif /* (CFG_LED_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)
  Joystick_Init(0);
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
#if (CFG_LCD_SUPPORTED == 1)
  LCD_Init();
  UTIL_SEQ_RegTask(1U << CFG_TASK_MENU_PRINT_ID, UTIL_SEQ_RFU, Menu_Print_Task);
#endif /* CFG_LCD_SUPPORTED */

  /* USER CODE END APPE_Init_1 */
  /* Create thread for BPKA and semaphore to control it*/
  BpkaSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( BpkaSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : BPKA SEMAPHORE CREATION FAILED" );
    while(1);
  }

  BpkaTaskId = osThreadNew( BPKA_Task, NULL, &stBPKATaskAttributes );
  if ( BpkaTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : BPKA TASK CREATION FAILED" );
    while(1);
  }

  BPKA_Reset( );

  RNG_Init();

  /* Disable flash before any use - RFTS */
  FD_SetStatus (FD_FLASHACCESS_RFTS, LL_FLASH_DISABLE);
  /* Enable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_ENABLE);
  /* Enable flash system flag */
  FD_SetStatus (FD_FLASHACCESS_SYSTEM, LL_FLASH_ENABLE);

  APP_BLE_Init();
  
  /* create a SW timer to wakeup system from low power */
  UTIL_TIMER_Create(&TimerOSwakeup_Id,
                    0,
                    UTIL_TIMER_ONESHOT,
                    &TimerOSwakeupCB, 0);
  
#if ( CFG_LPM_LEVEL != 0)
  maximumPossibleSuppressedTicks = UINT32_MAX;// TODO check this value
#endif /* ( CFG_LPM_LEVEL != 0) */

  
  /* Disable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_DISABLE);

  /* Thread Initialisation */
  APP_THREAD_Init();
  ll_sys_config_params();
  
  /* USER CODE BEGIN APPE_Init_2 */
#if (CFG_JOYSTICK_SUPPORTED == 1)
  /* Create thread for Joystick and semaphore to control it*/
  JoystickSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( JoystickSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : JOTSTICK SEMAPHORE CREATION FAILED" );
    while(1);
  }
  
  JoystickTaskId = osThreadNew( Joystick_Task, NULL, &stJoySTickTaskAttributes );
  if ( JoystickTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : JOTSTICK TASK CREATION FAILED" );
    while(1);
  }
  

  /* Create periodic timer for joystick position reading */
  UTIL_TIMER_Create(&JOYSTICK_TimerObj, 100, UTIL_TIMER_PERIODIC, &Joystick_TimerCallback, 0);
  
#endif /* CFG_JOYSTICK_SUPPORTED */

  /* Indicate to the low power manager that the Standby mode isn't allow : Stop mode will be used in low power mode*/
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_DISABLE);

  /* USER CODE END APPE_Init_2 */
  APP_DEBUG_SIGNAL_RESET(APP_APPE_INIT);
  return WPAN_SUCCESS;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Configure HSE by read this Tuning from OTP
 *
 */
static void Config_HSE(void)
{
  OTP_Data_s* otp_ptr = NULL;

  /* Read HSE_Tuning from OTP */
  if (OTP_Read(DEFAULT_OTP_IDX, &otp_ptr) != HAL_OK)
  {
    /* OTP no present in flash, apply default gain */
    HAL_RCCEx_HSESetTrimming(0x0C);
  }
  else
  {
    HAL_RCCEx_HSESetTrimming(otp_ptr->hsetune);
  }
}

/**
 *
 */
static void System_Init( void )
{
  /* Clear RCC RESET flag */
  LL_RCC_ClearResetFlags();

  UTIL_TIMER_Init();

  /* Enable wakeup out of standby from RTC ( UTIL_TIMER )*/
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN7_HIGH_3);

#if (CFG_LOG_SUPPORTED != 0) || (OT_CLI_USE == 1)

   MX_USART1_UART_Init();
   
