STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/Core/Src/app_entry.c
#if (CFG_LOG_SUPPORTED != 0)
  /* Initialize the logs ( using the USART ) */
  Log_Module_Init( Log_Module_Config );
#endif /* CFG_LOG_SUPPORTED */

  /* Initialize the Command Interpreter */
  Serial_CMD_Interpreter_Init();
#endif  /* (CFG_LOG_SUPPORTED != 0) */

#if(CFG_RT_DEBUG_DTB == 1)
  /* DTB initialization and configuration */
  RT_DEBUG_DTBInit();
  RT_DEBUG_DTBConfig();
#endif /* CFG_RT_DEBUG_DTB */

#if ( CFG_LPM_LEVEL != 0)
  system_startup_done = TRUE;
#endif /* ( CFG_LPM_LEVEL != 0) */

  return;
}

/**
 * @brief  Configure the system for power optimization
 *
 * @note  This API configures the system to be ready for low power mode
 *
 * @param  None
 * @retval None
 */
static void SystemPower_Config(void)
{
#if (CFG_SCM_SUPPORTED == 1)
  /* Initialize System Clock Manager */
  scm_init();
#endif /* CFG_SCM_SUPPORTED */

#if (CFG_DEBUGGER_LEVEL == 0)
  /* Pins used by SerialWire Debug are now analog input */
  GPIO_InitTypeDef DbgIOsInit = {0};
  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  HAL_GPIO_Init(GPIOA, &DbgIOsInit);

  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_3|GPIO_PIN_4;
  HAL_GPIO_Init(GPIOB, &DbgIOsInit);
#endif /* CFG_DEBUGGER_LEVEL */

#if (CFG_LPM_LEVEL != 0)
  /* Initialize low Power Manager. By default enabled */
  UTIL_LPM_Init();

#if (CFG_LPM_STDBY_SUPPORTED == 1)
  /* Enable SRAM1, SRAM2 and RADIO retention*/
  LL_PWR_SetSRAM1SBRetention(LL_PWR_SRAM1_SB_FULL_RETENTION);
  LL_PWR_SetSRAM2SBRetention(LL_PWR_SRAM2_SB_FULL_RETENTION);
  LL_PWR_SetRadioSBRetention(LL_PWR_RADIO_SB_FULL_RETENTION); /* Retain sleep timer configuration */

#else /* (CFG_LPM_STDBY_SUPPORTED == 1) */
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_DISABLE);
#endif /* (CFG_LPM_STDBY_SUPPORTED == 1) */
#endif /* (CFG_LPM_LEVEL != 0)  */

  /* USER CODE BEGIN SystemPower_Config */

  /* USER CODE END SystemPower_Config */
}

static void HW_RNG_Process_Task( void * argument )
{
  UNUSED( argument );
  for(;;)
  {
    osSemaphoreAcquire(HwRngSemaphore, osWaitForever);
    HW_RNG_Process();
    osThreadYield();
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
#if (CFG_LED_SUPPORTED == 1)
static void Led_Init( void )
{
  /* Leds Initialization */
  BSP_LED_Init(LED_RED);
  BSP_LED_On(LED_RED);

  return;
}
#endif /* CFG_LED_SUPPORTED */

#if (CFG_JOYSTICK_SUPPORTED == 1)
static void Joystick_Init( uint8_t wkup_mode )
{
  if (wkup_mode == 1)
  {
    /* configuration as a WKUP Pin */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin       = JOY1_CHANNEL_GPIO_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(JOY1_CHANNEL_GPIO_PORT, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(EXTI1_IRQn, 15, 0);
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
  }
  else
  {
    BSP_JOY_Init(JOY1, JOY_MODE_POLLING, JOY_ALL);
    /* reconfiguration of the ADC4 interrupt priority */
    HAL_NVIC_DisableIRQ(ADC4_IRQn);
    HAL_NVIC_SetPriority(ADC4_IRQn, 15, 0);
    HAL_NVIC_EnableIRQ(ADC4_IRQn);
  }
}

static void Joystick_TimerCallback(void *arg)
{
  osSemaphoreRelease(JoystickSemaphore);
}

static void Joystick_ActionHandle(void)
{
  /* Joystick reinitialization */
  Joystick_Init(0);

  int32_t state = BSP_JOY_GetState(JOY1);

  BSP_JOY_DeInit(JOY1, JOY_ALL);



  /* process Joystick information */
  if (state != JOY_NONE && state != Joystick_Prev_State)
  {
    if (state == JOY_SEL)
    {
    }
    else if (state == JOY_UP)
    {
      /* do nothing */
    }
    else if (state == JOY_RIGHT)
    {
      Joystick_Right();
    }
    else if (state == JOY_DOWN)
    {
      /* do nothing */
    }
    else if (state == JOY_LEFT)
    {
      Joystick_Left();
    }
  }

  Joystick_Prev_State = state;
}
#endif  /* CFG_JOYSTICK_SUPPORTED */

#if (CFG_LCD_SUPPORTED == 1)

static void LCD_Init( void )
{
  /* BSP init LCD*/
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Set LCD Foreground Layer  */
  UTIL_LCD_SetFuncDriver(&LCD_Driver); /* SetFunc before setting device */
  UTIL_LCD_SetDevice(0);               /* SetDevice after funcDriver is set */

  BSP_LCD_DisplayOn(0);

  BSP_LCD_Clear(0,SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* Set the LCD Text Color */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
  UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* release bus for power optimisation */
  BSP_SPI3_DeInit();
}

#endif  /* CFG_LCD_SUPPORTED */


/**
 * @brief Initialize Random Number Generator module
 */
static void RNG_Init(void)
{
  // -- Init & Start Random Generation --
  HW_RNG_Start();

  /* Register Semaphore to launch the Random Process */
  HwRngSemaphore = osSemaphoreNew( 1, 0, NULL ); 
  if ( HwRngSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : RANDOM PROCESS SEMAPHORE CREATION FAILED" );
    while(1);
  }

  /* Create the Random Process Thread */
  RandomProcessTaskId = osThreadNew( HW_RNG_Process_Task, NULL, &stRandomProcessTaskAttributes );
  if ( RandomProcessTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : RANDOM PROCESS TASK CREATION FAILED" );
    while(1);
  }
}

static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize)
{
  UTIL_MM_Init ((uint8_t *)p_PoolAddr, ((size_t)PoolSize * sizeof(uint32_t)));
}

static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize)
{
  return (uint32_t *)UTIL_MM_GetBuffer (((size_t)BufferSize * sizeof(uint32_t)));
}

static void AMM_WrapperFree (uint32_t * const p_BufferAddr)
{
  UTIL_MM_ReleaseBuffer ((void *)p_BufferAddr);
}

/* OS tick callback */
static void TimerOStickCB(void *arg)
{
  xPortSysTickHandler();
  /* USER CODE BEGIN TimerOStickCB */
  HAL_IncTick();
  /* USER CODE END TimerOStickCB */

  return;
}

/* OS wakeup callback */
static void TimerOSwakeupCB(void *arg)
{
  /* USER CODE BEGIN TimerOSwakeupCB */

  /* USER CODE END TimerOSwakeupCB */
  return;
}

#if ( CFG_LPM_LEVEL != 0)
static void preOSsleepProcessing(uint32_t expectedIdleTime)
{
  LL_PWR_ClearFlag_STOP();

